МультиПорт/src/Catalogs/MultiPort_НастройкиВходящихСообщений/MultiPort_НастройкиВходящихСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>MultiPort_НастройкиВходящихСообщений</name>
  <attributes>
    <name>ОбрабатыватьСразуПриПолучении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВходящего</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработкиВходящегоСообщения</name>
    <type>
      <types>EnumRef.MultiPort_СпособыПреобразованияСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроизвольногоОбработчика</name>
    <type>
      <types>EnumRef.MultiPort_ВариантыПроизвольногоОбработчика</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНастройки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВстроенногоОбработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОбработкиСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПараметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопЗначениеСоответствия</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МультиПорт/src/Enums/MultiPort_СпособыПреобразованияСообщений/MultiPort_СпособыПреобразованияСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MultiPort_СпособыПреобразованияСообщений</name>
  <enumValues>
    <name>ПроизвольныйАлгоритм</name>
  </enumValues>
  <enumValues>
    <name>КонструкторСообщения</name>
  </enumValues>
  <enumValues>
    <name>ПравилоКонвертации</name>
  </enumValues>
</mdclass:Enum>

МультиПорт/src/Enums/MultiPort_ВариантыПроизвольногоОбработчика/MultiPort_ВариантыПроизвольногоОбработчика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MultiPort_ВариантыПроизвольногоОбработчика</name>
  <enumValues>
    <name>ПроизвольныйКод</name>
  </enumValues>
  <enumValues>
    <name>ВстроенныйОбработчик</name>
  </enumValues>
  <enumValues>
    <name>ПодключаемыйОбработчик</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяВнеПодсистемы</name>
  </enumValues>
</mdclass:Enum>

МультиПорт/src/Catalogs/MultiPort_НастройкиВходящихСообщений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СпособОбработкиВходящегоСообщенияПриИзмененииНаСервере();
	ВариантПроизвольногоОбработчикаПриИзмененииНаСервере();
	
КонецПроцедуры
 
#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СпособОбработкиВходящегоСообщенияПриИзменении(Элемент)
	СпособОбработкиВходящегоСообщенияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпособОбработкиВходящегоСообщенияПриИзмененииНаСервере()
	
	СпособОбработкиВходящегоСообщения = Объект.СпособОбработкиВходящегоСообщения;
	МассивСтраницСпособов = Новый Массив;
	МассивСтраницСпособов.Добавить("КонструкторСообщения");
	МассивСтраницСпособов.Добавить("ПроизвольныйАлгоритм");
	
	Для Каждого ИмяСтраницы Из МассивСтраницСпособов Цикл
		ВидимостьСтраницы = СпособОбработкиВходящегоСообщения = 
						Перечисления.MultiPort_СпособыПреобразованияСообщений[ИмяСтраницы];
		Элементы["Страница" + ИмяСтраницы].Видимость = ВидимостьСтраницы;		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПроизвольногоОбработчикаПриИзменении(Элемент)	
	ВариантПроизвольногоОбработчикаПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВариантПроизвольногоОбработчикаПриИзмененииНаСервере()
	
	ВариантПроизвольногоОбработчика = Объект.ВариантПроизвольногоОбработчика;
	
	Элементы.ИмяВстроенногоОбработчика.Видимость = Ложь;
	Элементы.ОбработкаВходящего.Видимость = Ложь;
	Элементы.ГруппаКодФормирования.Видимость = Ложь;
	Элементы.ИнфоВариантОбработчикаИной.Видимость = Ложь;
	
	Если ВариантПроизвольногоОбработчика = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ВстроенныйОбработчик Тогда
		Элементы.ИмяВстроенногоОбработчика.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ПодключаемыйОбработчик Тогда
		Элементы.ОбработкаВходящего.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ПроизвольныйКод Тогда
		Элементы.ГруппаКодФормирования.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ОпределяетсяВнеПодсистемы Тогда
		Элементы.ИнфоВариантОбработчикаИной.Видимость = Истина; 		
	Иначе
		Элементы.ИнфоВариантОбработчикаИной.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
